Tecnologia/100008074.md

Suport Tècnic : Assentaments d'entrada reenviats  

1.  [Suport Tècnic](index.html)
2.  [Suport Tècnic](13893782.html)
3.  [02 - FAQ's serveis](26313393.html)
4.  [FAQ's SIR 2.0](41523073.html)
5.  [SIR 2.0 - FORMACIÓ - Resolució d'incidències](93357198.html)

Suport Tècnic : Assentaments d'entrada reenviats
================================================

Created by Oriol Bernal, last modified on 06 October 2023

[ZD#140190](https://aoccat.zendesk.com/agent/tickets/140190)

**Descripció incidència**

Bona tarda,  
   
Des del Servei Català de la Salut, la usuària amb DNI 46535050R, ens indica que el Departament de Salut els ha reenviat al CatSalut a través del SIR, un assentament de data 17/01/2023, que els hi ha entrat avui a la seva oficina de registre, però no el troben a la seva oficina.  
Les dades que tenen de l'assentament són les següents: Identificador intercanvi SIR: O00005633\_23\_00026160 i Número de registre 20234080000014957.  
![](https://suport.aoc.cat/attachments/token/mfmiiMNV49Kq4PRwtQnBtv52s/?name=image003.jpg)

Ho podeu revisar, si us plau?  
Gràcies.

Explicació

Del missatge de l'usuari obtenim les següents dades:

*   Usuària amb DNI **46535050R**
*   El **Departament de Salut**  reenvia el tràmit a **CatSalut**
    *   **Departament de Salut** → [https://mux.aoc.cat/admin/eacat](https://mux.aoc.cat/admin/eacat) → **9610800000**
    *   **CatSalut ???**
*   ID\_SIR: **O00005633\_23\_00026160**
*   Número de registre **20234080000014957**

En aquest cas tenim les dades suficients i no ens farà falta impersonar-nos. Podem veure l'estat del tràmit directament a la base de dades:

select case
         when i.tipus = 0 then 'Enviament'
         when i.tipus = 1 then 'Recepció'
       end as TIPUS\_INTERCANVI,
       case
         when i.estat = 0 then 'Pendent d''enviar'
         when i.estat = 1 then 'Pendent de confirmar'
         when i.estat = 2 then 'Confirmat'
         when i.estat = 3 then 'Rebutjat'
         when i.estat = 4 then 'Reenviat'
         when i.estat = 5 then 'Error'
       end as ESTAT\_LITERAL,
       case
         when a.tipus = 0 then 'Enviament'
         when a.tipus = 1 then 'Reenviament'
         when a.tipus = 2 then 'Rebuig'
         when a.tipus = 3 then 'ACK'
         when a.tipus = 4 then 'Error'
         when a.tipus = 5 then 'Confirmació'
         when a.tipus = 6 then 'Reenviament a inici'
       end as TIPUS\_APUNT,
       i.\*,
       a.\*
  from SIR\_PCI.SIR\_INTERCANVI i, SIR\_PCI.SIR\_APUNT a
 where a.id\_intercanvi = i.id
  and id\_sir in ('O00005633\_23\_00026160')
 order by i.id, a.data asc;

Podrem veure els resultats de la consulta a la següent taula (s'han omès columnes i s'han deixat les de més interès):

TIPUS INTERCANVI

ESTAT INTERCANVI

TIPUS APUNT

ID

CODI\_ENS

OFICINA\_ORIGEN

OFICINA\_INICIAL

OFICINA\_DESTI

DATA APUNT

OFICINA\_ORIGEN APUNT

OFICINA\_DESTI APUNT

Recepció

Reenviat

**Enviament**

1399636

9610800000

**O00005633**

**O00005633**

**O00007500**

05/10/23 08:17

**O00005633**

**null**

Recepció

Reenviat

**ACK**

1399636

9610800000

**O00005633**

**O00005633**

**O00007500**

05/10/23 08:18

**null**

**O00005633**

Recepció

Reenviat

**Reenviament**

1399636

9610800000

**O00005633**

**O00005633**

**O00007500**

05/10/23 11:05

**null**

**O00007524**

Trobem l'intercanvi i sembla tot correcte, i l'històric d'accions ha sigut el següent:

*   05/10/23 08:17 → L'oficina d'origen (i inicial) **O00005633** fa un **Enviament** cap al destí **O00007500.**
*   05/10/23 08:18 → El destí (**O00007500**) respon amb un **ACK l'**origen **O00005633** (procés automàtic)
*   05/10/23 11:05 → El destí (**O00007500**) ha de fer quelcom amb el tràmit, en aquest cas decideix fer un **Reenviament** cap a un 3r, l'oficina **O00007524** (procés manual)

A priori el resultat sembla normal, però **què passa quan es reenvia un tràmit?**

Quan es reenvia un tràmit, aquest es duplica, és a dir, a la nostra base de dades, hauríem de veure dos tràmits idèntics (mateix **ID\_SIR**, però diferent **ID**) però amb diferents destinataris. El primer tràmit es queda en estat 4 (**REENVIAT**) que es considera un estat final, i el segon segueix el flux normal que seguiria un tràmit (**PENDENT D'ENVIAR → PENDENT DE CONFIRMAR → CONFIRMAT/REBUTJAT/REENVIAT**).

Un tràmit es pot reenviar molts cops, però mai podrem repetir un receptor, i els receptors hauran de ser sempre entitats públiques catalanes. Si A, B, C i D són entitats de Catalunya

*   OK: Emissor no català → A → B → C → D
*   KO:  Emissor no català → A → B → C → A
*   KO:  Emissor no català → A → B → C → B

Per tant, com hem fet la cerca per **l'ID\_SIR**, hauríem de veure un altre tràmit. A la query haurien d'aparèixer almenys dues files més (**Enviament** i **ACK**) que s'han de produir automàticament. Però sembla que s'ha produït algun error i el reenviament real no s'ha realitzat (tot i que el tràmit inicial sí que es troba en estat **Reenviat**)

FAQ per solucionar aquests casos
================================

FAQ amb la solució

  

Explicació

A les recepcions del SIR, quan un ens d'EACAT rep un tràmit, pot fer 3 accions; Confirmar, Rebutjar o Reenviar. Si un ens decideix reenviar el tràmit a una altra entitat, el tràmit es quedarà en estat REENVIAT i apareixerà un tràmit nou a la base de dades (mateix id\_sir però diferent id).

A vegades, el reenviament es produeix i el tràmit s'actualitza a estat REENVIAT, però no es genera un tràmit nou (que fa efectiu el reenviament):

![](attachments/64980588/64980603.png)

Solució:
--------

Les accions a realitzar per aquest tipus d'error:

1.  Buscar el tràmit
    
     select case
              when i.tipus = 0 then 'Enviament'
              when i.tipus = 1 then 'Recepció'
            end as TIPUS\_INTERCANVI,
            case
              when i.estat = 0 then 'Pendent d''enviar'
              when i.estat = 1 then 'Pendent de confirmar'
              when i.estat = 2 then 'Confirmat'
              when i.estat = 3 then 'Rebutjat'
              when i.estat = 4 then 'Reenviat'
              when i.estat = 5 then 'Error'
            end as ESTAT\_LITERAL,
            case
              when a.tipus = 0 then 'Enviament'
              when a.tipus = 1 then 'Reenviament'
              when a.tipus = 2 then 'Rebuig'
              when a.tipus = 3 then 'ACK'
              when a.tipus = 4 then 'Error'
              when a.tipus = 5 then 'Confirmació'
              when a.tipus = 6 then 'Reenviament a inici'
            end as TIPUS\_APUNT,
            i.\*,
            a.\*
       from SIR\_PCI.SIR\_INTERCANVI i, SIR\_PCI.SIR\_APUNT a
      where a.id\_intercanvi = i.id
        --and i.registre\_sortida = 'XXX'
        and i.origen\_registre\_entrada = 'XXX'
        --and i.desti\_registre\_entrada = 'XXX'
        and i.codi\_ens = 'XXX'
      order by a.data, i.id desc;
    
2.  Modificar l'estat a Pendent de Confirmar
    
     update SIR\_PCI.SIR\_INTERCANVI
       set estat = 1 --Pendent de confirmar
     where id = XXX
    
3.  Enviar una nova petició de reenviament:  
    Podrem trobar el projecte de SoapUI del SIR al SS de PCI30 (sota el directori **docs/proves**). Haurem de modificar les dades de l'XML amb les dades del tràmit i fer una petició de reenviament:
    
    Podrem llençar la petició directament contra la MTI per evitar signar amb el certificat de l'ens. Haurem d'introduir les dades:
    
    *   **IdentificadorSolicitante**: El codi de l'ens informat a la bdd del tràmit (columna **SIR\_INTERCANVI.CODI\_ENS**)
    *   **NombreSolicitante**: El nom de l'ens a qui correspongui el codi:
        
         select \* from usu\_ens e where e.uen\_codi\_10 = '9610210007'
        
    *   **Finalidad**: La finalitat que l'ens tingui donada d'alta, normalment **TRAMITACIO**
    *   **idEnviamentSIR**: L'id del SIR (columna **SIR\_INTERCANVI.ID\_SIR**)
    *   **oficinaRegistreDesti**: El destinatari del reenviament (columna **SIR\_APUNT.OFICINA\_DESTI**)
        
        No ens podem confondre, haurem d'agafar el valor del camp OFICINA\_DESTI per l'apunt que sigui de tipus REENVIAMENT i sigui el reenviment que hagi fallat:  
        ![](attachments/64980588/64980604.png)
        
    *   **observacions**: El motiu del reenviament (columna **SIR\_APUNT.MISSATGE**)
        
        Com en el cas anterior, no ens podem confondre, haurem d'agafar el valor del camp MIssatge per l'apunt que sigui de tipus REENVIAMENT i sigui el reenviment que hagi fallat:  
        ![](attachments/64980588/64980604.png)
        
    
      
    Exemple de petició:
    
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://www.openuri.org/" xmlns:pet="http://gencat.net/scsp/esquemes/peticion">
       <soapenv:Header/>
       <soapenv:Body>
          <open:procesa>
             <Peticion xmlns="http://gencat.net/scsp/esquemes/peticion">
                <Atributos>
                   <IdPeticion>CUX-SIR-RECEPCIO-${=(long)(System.currentTimeMillis())}</IdPeticion>
                   <NumElementos>1</NumElementos>
                   <TimeStamp/>
                   <CodigoCertificado>SIR</CodigoCertificado>
                   <CodigoProducto>SIR</CodigoProducto>
                   <DatosAutorizacion>
                      <IdentificadorSolicitante>XXX</IdentificadorSolicitante>
                      <NombreSolicitante>XXX</NombreSolicitante>
                      <Finalidad>TRAMITACIO</Finalidad>
                   </DatosAutorizacion>
                </Atributos>
                <Solicitudes>
                   <SolicitudTransmision>
                      <DatosGenericos>
                         <Solicitante>
                            <IdentificadorSolicitante>XXX</IdentificadorSolicitante>
                            <NombreSolicitante>XXX</NombreSolicitante>
                            <Finalidad>TRAMITACIO</Finalidad>
                            <Consentimiento>Si</Consentimiento>
                         </Solicitante>
                         <Transmision>
                            <CodigoCertificado>SIR</CodigoCertificado>
                            <IdSolicitud>1</IdSolicitud>
                            <IdTransmision/>
                            <FechaGeneracion/>
                         </Transmision>
                      </DatosGenericos>
                      <DatosEspecificos>
                         <peticioReenviamentAssentament xmlns="http://www.aoc.cat/sir">
                            <idEnviamentSIR>XXX</idEnviamentSIR>
                            <oficinaRegistreDesti>XXX</oficinaRegistreDesti>                        
                            <observacions>XXX</observacions>
                         </peticioReenviamentAssentament>
                      </DatosEspecificos>
                   </SolicitudTransmision>
                </Solicitudes>
             </Peticion>
          </open:procesa>
       </soapenv:Body>
    </soapenv:Envelope>
    
4.  Sincronitzar-lo amb EACAT
    
    select \* from SIR\_PCI.SIR\_SINCRONITZACIO WHERE ID\_INTERCANVI = XXX
    
    update SIR\_PCI.SIR\_SINCRONITZACIO
       set sincronitzat\_eacat = 0 --Pendent de sincronitzar
     where id\_intercanvi = XXX
    

Finalment, haurem de veure que a la base de dades (podrem utilitzar la query inicial) que efectivament el tràmit torna a estar en estat REENVIAT, però aquest cop apareix una nova fila amb un identificador nou que es troba en estat pendent de confirmar:

![](attachments/64980588/64980605.png)

  

Validar la solució
==================

En aquest cas hem realitzat les següents accions:

*   Update de l'estat

update SIR\_PCI.SIR\_INTERCANVI
  set estat = 1 --Pendent de confirmar
where id\_sir in ('O00005633\_23\_00026160')

*   Petició SOAP contra el nostre motor

**Endpoint: [http://10.120.4.58/aoc-pci3-mti/Sincron![](images/icons/linkext7.gif)](http://10.120.4.58/aoc-pci3-mti/Sincron)**

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://www.openuri.org/" xmlns:pet="http://gencat.net/scsp/esquemes/peticion">
   <soapenv:Header/>
   <soapenv:Body>
      <open:procesa>
         <Peticion xmlns="http://gencat.net/scsp/esquemes/peticion">
            <Atributos>
               <IdPeticion>ZD140190-SIR-RECEPCIO-${=(long)(System.currentTimeMillis())}</IdPeticion>
               <NumElementos>1</NumElementos>
               <TimeStamp/>
               <CodigoCertificado>SIR</CodigoCertificado>
               <CodigoProducto>SIR</CodigoProducto>
               <DatosAutorizacion>
                  <IdentificadorSolicitante>9610800000</IdentificadorSolicitante>
                  <NombreSolicitante>Departament de Salut</NombreSolicitante>
                  <Finalidad>TRAMITACIO</Finalidad>
               </DatosAutorizacion>
            </Atributos>
            <Solicitudes>
               <SolicitudTransmision>
                  <DatosGenericos>
                     <Solicitante>
                        <IdentificadorSolicitante>9610800000</IdentificadorSolicitante>
                        <NombreSolicitante>Departament de Salut</NombreSolicitante>
                        <Finalidad>TRAMITACIO</Finalidad>
                        <Consentimiento>Si</Consentimiento>
                     </Solicitante>
                     <Transmision>
                        <CodigoCertificado>SIR</CodigoCertificado>
                        <IdSolicitud>1</IdSolicitud>
                        <IdTransmision/>
                        <FechaGeneracion/>
                     </Transmision>
                  </DatosGenericos>
                  <DatosEspecificos>
                     <peticioReenviamentAssentament xmlns="http://www.aoc.cat/sir">
                        <idEnviamentSIR>O00005633\_23\_00026160</idEnviamentSIR>
                        <oficinaRegistreDesti>O00007524</oficinaRegistreDesti>                       
                        <observacions>Per la Fundació Gestió Sanitaria Hospital Sta.Creu i St.Pau.</observacions>
                     </peticioReenviamentAssentament>
                  </DatosEspecificos>
               </SolicitudTransmision>
            </Solicitudes>
         </Peticion>
      </open:procesa>
   </soapenv:Body>
</soapenv:Envelope>  

  

I si tornem a revisar la primerà query obtenim els resultats:

TIPUS INTERCANVI

ESTAT INTERCANVI

TIPUS APUNT

ID

CODI\_ENS

OFICINA\_ORIGEN

OFICINA\_INICIAL

OFICINA\_DESTI

DATA APUNT

OFICINA\_ORIGEN APUNT

OFICINA\_DESTI APUNT

Recepció

Reenviat

**Enviament**

**1399636**

9610800000

**O00005633**

**O00005633**

**O00007500**

05/10/23 08:17

**O00005633**

**null**

Recepció

Reenviat

**ACK**

**1399636**

9610800000

**O00005633**

**O00005633**

**O00007500**

05/10/23 08:18

**null**

**O00005633**

Recepció

Reenviat

**Reenviament**

**1399636**

9610800000

**O00005633**

**O00005633**

**O00007500**

05/10/23 11:05

**null**

**O00007524**

Recepció

Reenviat

**Reenviament**

**1399636**

9610800000

**O00005633**

**O00005633**

**O00007500**

05/10/23 11:05

**null**

**O00007524**

Recepció

Reenviat

**ACK**

**1399636**

9610800000

**O00005633**

**O00005633**

**O00007500**

06/10/23 09:56

**O00007524**

**null**

Recepció

Pendent de confirmar

**Enviament**

**1402662**

**7515090320**

**O00007500**

**O00005633**

**O00007524**

06/10/23 09:56

**O00007500**

**null**

Recepció

Pendent de confirmar

**ACK**

**1402662**

**7515090320**

**O00007500**

**O00005633**

**O00007524**

06/10/23 09:56

**null**

**O00007500**

  

Si revisem el color de fons de les files:

*   En vermell veurem les 3 files que ja teníem al començament → Hem canviat l'estat a pendent de confirmar, però després d'enviar la petició al motor s'ha tornat a posar en estat Reenviat
*   En groc: Aquesta fila és una còpia exacta de l'anterior, és normal, ja que hem simulat la mateixa acció que fa l'usuari
*   En verd: El comportament esperat d'un reenviament realitzat correctament. Primer hem de rebre l'ACK i després s'han de crear dues files addicional Enviament i ACK del nou tràmit (diferent ID).

  

**Missatge tipus**

Bon dia,

Es va realitzar un reenviament que per un error tècnic no es va produir. Hem tornat a forçar el mateix i ara el receptor ja l'hauria de tenir a la seva safata d'entrada.

Salutacions i disculpeu les molèsties

  

Attachments:
------------

![](images/icons/bullet_blue.gif) [image2023-9-15\_10-6-27.png](attachments/100008074/100008075.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2023-9-15\_9-40-10.png](attachments/100008074/100008076.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2023-9-15\_9-33-20.png](attachments/100008074/100008077.png) (image/png)  

Document generated by Confluence on 02 June 2025 11:00

[Atlassian](http://www.atlassian.com/)